#  Performing an anti join

```
Exercise ID 1133460
```

##  Assignment 

In our music streaming company dataset, each customer is assigned an employee representative to assist them. In this exercise, filter the employee table by a table of top customers, returning only those employees who are **not** assigned to a customer. The results should resemble the results of an anti join. The company's leadership will assign these employees additional training so that they can work with high valued customers.

The `top_cust` and `employees` tables have been provided for you.

##  Pre exercise code 

```
from pickle import load
import urllib.request
import pandas as pd

fn_tcust = 'https://assets.datacamp.com/production/repositories/5486/datasets/b8a38619714ef17f99ac1cad7bb8ee95497d21dc/top_cust.p'
fn_emp = 'https://assets.datacamp.com/production/repositories/5486/datasets/be325ed5e26abedbf5a65d454176d03a16a388d7/employees.p'

top_cust = load(urllib.request.urlopen(fn_tcust))
employees = load(urllib.request.urlopen(fn_emp))
```

In [1]:
from pickle import load
import urllib.request
import pandas as pd

In [5]:
top_cust = pd.read_pickle("top_cust.p")
employees = pd.read_pickle("employees.p")

In [6]:
top_cust.head(1)

,cid,srid,fname,lname,phone,fax,email
0,1,3,Luís,Gonçalves,+55 (12) 3923-5555,+55 (12) 3923-5566,luisg@embraer.com.br

In [7]:
employees.head(1)

   srid  lname   fname            title  hire_date                   email
0     1  Adams  Andrew  General Manager 2002-08-14  andrew@chinookcorp.com

##  Instructions 

- Merge `employees` and `top_cust` with a left join, setting `indicator` argument to `True`. Save the result to `empl_cust`.

In [13]:
empl_cust = employees.merge(top_cust, on="srid", how="left", indicator=True, suffixes=["_emp", "_cust"])

In [14]:
empl_cust.head()

,srid,lname_emp,fname_emp,title,hire_date,email_emp,cid,fname_cust,lname_cust,phone,fax,email_cust,_merge
0,1,Adams,Andrew,General Manager,2002-08-14,andrew@chinookcorp.com,NaN,NaN,NaN,NaN,NaN,NaN,left_only
1,2,Edwards,Nancy,Sales Manager,2002-05-01,nancy@chinookcorp.com,NaN,NaN,NaN,NaN,NaN,NaN,left_only
2,3,Peacock,Jane,Sales Support Agent,2002-04-01,jane@chinookcorp.com,1.0,Luís,Gonçalves,+55 (12) 3923-5555,+55 (12) 3923-5566,luisg@embraer.com.br,both
3,3,Peacock,Jane,Sales Support Agent,2002-04-01,jane@chinookcorp.com,3.0,François,Tremblay,+1 (514) 721-4711,NaN,ftremblay@gmail.com,both
4,3,Peacock,Jane,Sales Support Agent,2002-04-01,jane@chinookcorp.com,12.0,Roberto,Almeida,+55 (21) 2271-7000,+55 (21) 2271-7070,roberto.almeida@riotur.gov.br,both

- Select the `srid` column of `empl_cust` and the rows where `_merge` is `'left_only'`. Save the result to `srid_list`.

In [15]:
srid_list = empl_cust[empl_cust["_merge"] == "left_only"]["srid"]

In [16]:
srid_list.head()

0     1
1     2
61    6
62    7
63    8
Name: srid, dtype: int64

- Subset the `employees` table and select those rows where the `srid` is in the variable `srid_list` and print the results.

In [17]:
employees[employees["srid"].isin(srid_list)]

,srid,lname,fname,title,hire_date,email
0,1,Adams,Andrew,General Manager,2002-08-14,andrew@chinookcorp.com
1,2,Edwards,Nancy,Sales Manager,2002-05-01,nancy@chinookcorp.com
5,6,Mitchell,Michael,IT Manager,2003-10-17,michael@chinookcorp.com
6,7,King,Robert,IT Staff,2004-01-02,robert@chinookcorp.com
7,8,Callahan,Laura,IT Staff,2004-03-04,laura@chinookcorp.com